# Data Science and Visualization (RUC F2023)

## Lecture 2: Exploratory Data Analysis (EDA)

# Exercise 2:

Titanic dataset: write your code in a JupyterNotebook
1. Get the average age value for each sex group.
2. Fill in the missing age values as the average age of the corresponding sex group.

In [1]:
import os
import numpy as np 
import pandas as pd

os.chdir('C:/Data')
titanic = pd.read_csv('titanic.csv')

In [6]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
avg_age = titanic['Age'].mean()
print(avg_age)

29.69911764705882

### 1. Get the average age for each sex group.

In [14]:
avg_age_male = titanic['Age'][titanic.Sex=='male'].mean()
print(avg_age_male)

30.72664459161148

In [15]:
avg_age_female = titanic['Age'][titanic.Sex=='female'].mean()
print(avg_age_female)

27.915708812260537

### 2. Fill in the missing age values as the average age of the corresponding sex group.

In [18]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
titanic['Age'].fillna(titanic.groupby('Sex')['Age'].transform('mean'), inplace=True)

In [33]:
titanic[titanic.Sex=='female'].isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          217
Embarked         2
dtype: int64

In [32]:
titanic[titanic.Sex=='male'].isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          470
Embarked         0
dtype: int64